innovation-cloud/app/controllers/signups_controller.rb

    def create
        @signup = Signup.new(signup_params)
        if @signup.save
---
INSERT INTO "signups" ("email", "created_at", "updated_at") VALUES (?, ?, ?)  [["email", "lukeczoboriek@hotmail.co.uk"], ["created_at", "2022-06-17 10:53:41.280573"], ["updated_at", "2022-06-17 10:53:41.280573"]]