threadly/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
---
    def index
        @new_post = Post.new
        @all_posts = Post.order(created_at: :desc).all

INSERT INTO "posts" ("comment", "created_at", "updated_at") VALUES (?, ?, ?)  [["comment", "This is a brand new comment\n"], ["created_at", "2022-06-17 11:59:25.792741"], ["updated_at", "2022-06-17 11:59:25.792741"]]
---
    def create
        @post = Post.new(post_params)
        if @post.save